goodWordApp/goodWord_api_app/app/controllers/articles_controller.rb

INSERT INTO "articles" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "sdf"], ["created_at", "2020-01-15 23:51:01.535063"], ["updated_at", "2020-01-15 23:51:01.535063"]]
---
  def create
    puts 'params', params
    @article = Article.new(article_params)

    if @article.save

UPDATE "articles" SET "content" = $1, "updated_at" = $2 WHERE "articles"."id" = $3
---
  def update
    if @article.update(article_params)